Revit 2027 API
BuiltInFailures.OverlapFailures.OverlappingElementsTest Property
 There are overlapping structural framing elements of the same type in the project found by Dynamic Update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OverlappingElementsTest { get; }
Public Shared ReadOnly Property OverlappingElementsTest As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OverlappingElementsTest {
	FailureDefinitionId^ get ();
}
static member OverlappingElementsTest : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace